### Importing Libraries

In [1]:
import pandas as pd
import sys
import numpy as np

### Reading the dataset

In [2]:
df = pd.read_csv("used_bikes.csv")

In [ ]:
to_csv()

### Viewing top 5 rows of dataset

In [3]:
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

### Getting Dataset Info

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 9.4+ KB

### Checking Memory Usage

In [5]:
df.memory_usage()

Index          128
bike_name     1192
price         1192
city          1192
kms_driven    1192
owner         1192
age           1192
power         1192
brand         1192
dtype: int64

### Changing the datatype and Checking the memory size

### We are converting int64 to int8 because int8 take less memory, we are using "downcast" function that select the appropriate int size suitable for data

In [6]:
df['age']=pd.to_numeric(df['age'],downcast='integer')
df['age']

0      3
1      4
2      8
3      4
4      3
      ..
144    3
145    3
146    2
147    7
148    2
Name: age, Length: 149, dtype: int8

In [7]:
df['price']=pd.to_numeric(df['price'],downcast='integer')
df['price']

0       35000
1      119900
2      600000
3       65000
4       80000
        ...
144    115000
145     65000
146     99000
147     68500
148    140000
Name: price, Length: 149, dtype: int32

In [8]:
df['power']=pd.to_numeric(df['power'],downcast='integer')
df['power']

0      110
1      350
2      675
3      180
4      150
      ...
144    350
145    125
146    150
147    150
148    150
Name: power, Length: 149, dtype: int16

In [9]:
df['kms_driven']=pd.to_numeric(df['kms_driven'],downcast='integer')
df['kms_driven']

0      17654
1      11000
2        110
3      16329
4      10000
       ...
144    14900
145     2000
146     4000
147    68500
148     2473
Name: kms_driven, Length: 149, dtype: int32

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    object
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    object
dtypes: int16(1), int32(2), int8(1), object(4)
memory usage: 6.4+ KB

### comparing the info before and after converting the type we can see that the memory usage reduced to 6.4+ KB from 9.4+KB

In [13]:
df.to_csv('Memory_Reduced3.csv')

In [11]:
df2 = pd.read_csv('Memory_Reduced3.csv')

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  149 non-null    int64
 1   bike_name   149 non-null    object
 2   price       149 non-null    int64
 3   city        149 non-null    object
 4   kms_driven  149 non-null    int64
 5   owner       149 non-null    object
 6   age         149 non-null    int64
 7   power       149 non-null    int64
 8   brand       149 non-null    object
dtypes: int64(5), object(4)
memory usage: 10.6+ KB

### Mysql Part

### Connecting with MySQL

In [ ]:
import mysql.connector as sql
# import mysql.connector
#create user 'user'@'%' identified by 'password'
mydb = sql.connect(
  host="127.0.0.1",
  database='Task2',
  user="abc",
  passwd='password',
  auth_plugin = 'mysql_native_password'
)
mycursor = mydb.cursor()

### Creating Table Schema For Dumping

In [ ]:
mycursor.execute("CREATE TABLE BIKES (BIKE_NAME VARCHAR(100),
                 PRICE INT,
                 CITY VARCHAR(30),
                 KMS_DRIVEN INT,
                 OWNER VARCHAR(30),AGE INT,POWER INT,BRAND VARCHAR(100));")

### Dumping into MYSQL

In [ ]:
for i in range(len(df)):
    mycursor.execute('INSERT INTO BIKES (BIKE_NAME,PRICE,CITY,KMS_DRIVEN,OWNER,AGE,POWER,BRAND) VALUES (%s,%s,%s,%s,%s,%s,%s,%s)',
               (df['bike_name'][i],df['price'][i].astype('object'),
                df['city'][i],df['kms_driven'][i].astype('object'),df['owner'][i],
                df['age'][i].astype('object'),df['power'][i].astype('object'),df['brand'][i]))

### Commiting Changes

In [ ]:
mydb.commit() # then only it will be reflected to others who are all accessing the database.

### Creating the Index After Inserting. I have done the below part in  in MySQL for submission purpose I am Adding this code here.

In [ ]:
CREATE INDEX S_NO
ON BIKES (BIKE_NAME,PRICE,CITY,KMS_DRIVEN,OWNER,AGE,POWER,BRAND);

### After Indexing The table is Sorted Alphabetically.

##                                           Done by Elanchezhian K R